Tekla Open API Reference for Tekla Structures 2025
AngleDimension.Point1 Property
 Gets or sets the first point.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Point1 { get; set; }
Public Property Point1 As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
AngleDimension Class
Tekla.Structures.Drawing Namespace